In [1]:
import pandas as pd

In [11]:
df=pd.read_excel("C:/Users/Riya/Downloads/PandasDuplicateCheck.xlsx")
print(df)

   First Name Last Name                         Email   UniqueCode  \
0         Amy         J                           NaN      E6P4R5P
1       Liana   Earlene             liana@jsimple.com       aaaaaa
2      Stacey     Brown  stacey@insurtechhartford.com      bbbbbbb
3       Lalit   Chauhan             lalit@jsimple.com        ccccc
4       Liana   Earlene             liana@jsimple.com      26SO8HI
5      Stacey     Brown  stacey@insurtechhartford.com  STACEYBROWN
6       Lalit   Chauhan             lalit@jsimple.com        LALIT
7      Khushi         k             khushik@gmail.com      5WE7EQ1
8      Stacey     Brown  stacey@insurtechhartford.com      5WE7EQ2
9       Lalit   Chauhan             lalit@jsimple.com      5WE7EQ3
10      Lalit   Chauhan             lalit@jsimple.com      5WE7EQ3

   Company Name Job Title
0       Jsimple        BA
1       Jsimple       xxx
2      HrOntips     yyyyy
3    Insuretech     zzzzz
4             1         1
5             1         1
6             1         1
7             1        11
8             1        11
9             1        11
10            1        11

In [12]:
df.duplicated()#row wise tell if entire row duplicated

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10     True
dtype: bool

In [7]:
df["Email"].duplicated()
#row wise show all the rows that have duplicated 1st occurance of duplicate value as "False" like if Ritika 2 times 1st Ritika is false & second true

0    False
1    False
2    False
3    False
4     True
5     True
6     True
7    False
8     True
9     True
Name: Email, dtype: bool

In [9]:
df["Email"].duplicated().sum()# count of duplicated values(exclude 1st time existance of each just give extra duplicate count)

np.int64(5)

In [10]:
df.drop_duplicates("Email")#Keep first occurance of each duplicate col value and drop others and then print them

,First Name,Last Name,Email,UniqueCode,Company Name,Job Title
0,Amy,J,NaN,E6P4R5P,Jsimple,BA
1,Liana,Earlene,liana@jsimple.com,aaaaaa,Jsimple,xxx
2,Stacey,Brown,stacey@insurtechhartford.com,bbbbbbb,HrOntips,yyyyy
3,Lalit,Chauhan,lalit@jsimple.com,ccccc,Insuretech,zzzzz
7,Khushi,k,khushik@gmail.com,5WE7EQ1,1,11

In [17]:
df=df.drop_duplicates()#Keep first occurance of each duplicate row and drop others 
#since changes are not made to df but a new df creted then use assignment for same

In [16]:
print(df)

  First Name Last Name                         Email   UniqueCode  \
0        Amy         J                           NaN      E6P4R5P
1      Liana   Earlene             liana@jsimple.com       aaaaaa
2     Stacey     Brown  stacey@insurtechhartford.com      bbbbbbb
3      Lalit   Chauhan             lalit@jsimple.com        ccccc
4      Liana   Earlene             liana@jsimple.com      26SO8HI
5     Stacey     Brown  stacey@insurtechhartford.com  STACEYBROWN
6      Lalit   Chauhan             lalit@jsimple.com        LALIT
7     Khushi         k             khushik@gmail.com      5WE7EQ1
8     Stacey     Brown  stacey@insurtechhartford.com      5WE7EQ2
9      Lalit   Chauhan             lalit@jsimple.com      5WE7EQ3

  Company Name Job Title
0      Jsimple        BA
1      Jsimple       xxx
2     HrOntips     yyyyy
3   Insuretech     zzzzz
4            1         1
5            1         1
6            1         1
7            1        11
8            1        11
9            1        11